#+STARTUP: overview
Playing With Programs.

** 逆変換
#+begin_src python :results output
import base64

correct_password = b'\x13i\xe7).\x88mB'
print(type(correct_password))
correct_password = base64.b64encode(correct_password)
print(correct_password)
#+end_src

#+RESULTS:
: <class 'bytes'>
: b'E2nnKS6IbUI='

** チェック
#+begin_src python :results output
import base64

entered_password = b'E2nnKS6IbUI='
print(type(entered_password))
print(type(entered_password.decode("l1")))
entered_password = base64.b64decode(entered_password.decode("l1"))
print(entered_password)
#+end_src

#+RESULTS:
: <class 'bytes'>
: <class 'str'>
: b'\x13i\xe7).\x88mB'

** 実験
正解のバイナリデータがどのように処理されるのか確認する。

#+begin_src python :results output
import base64

def encode_to_bits(s):
    return b"".join(format(c, "08b").encode("latin1") for c in s)

correct_password = b'\x08\x9e\xb3zP\x03\x02\x03' # 元のバイナリデータ
correct_password = base64.b64encode(correct_password) # base64で変換
print(correct_password)
correct_password = correct_password.hex().encode("l1") # 16進数に変換してさらにエンコードする
print(correct_password)
correct_password = bytes.fromhex(correct_password.decode("l1")) # 戻せるかの実験
print(correct_password)
correct_password = correct_password.hex().encode("l1") # 戻してしまったので、再び変換する
correct_password = encode_to_bits(correct_password) # 0、1に変換する
print(correct_password)
correct_password = correct_password[::-1] # 並びを入れかえる
print(correct_password) # この出力の値となるような入力を探す
#+end_src

#+RESULTS:
: b'CJ6zelADAgM='
: b'434a367a656c414441674d3d'
: b'CJ6zelADAgM='
: b'001101000011001100110100011000010011001100110110001101110110000100110110001101010011011001100011001101000011000100110100001101000011010000110001001101100011011100110100011001000011001101100100'
: b'001001101100110000100110001011001110110001101100100011000010110000101100001011001000110000101100110001100110110010101100011011001000011011101100011011001100110010000110001011001100110000101100'

入力がどのように変換されていくのか確認する。

#+begin_src python :results output silent
# entered_password = b'434a367a656c414441674d3d'
entered_password = b'033333330333333313333333133333330333333313333333033333330333333303333333033333331333333313333333033333330333333313333333133333330333333303333333133333331333333303333333133333330333333303333333033333331333333313333333033333330333333303333333033333331333333303333333033333331333333313333333033333330333333313333333133333330333333303333333133333331333333303333333133333331333333303333333033333330333333313333333133333330333333313333333133333331333333303333333133333331333333303333333033333330333333303333333133333330333333303333333133333331333333303333333133333331333333303333333033333330333333313333333133333330333333313333333033333331333333303333333033333331333333313333333033333331333333313333333033333330333333313333333133333330333333303333333033333331333333313333333033333330333333313333333133333330333333313333333033333330333333303333333033333331333333313333333033333330333333303333333133333330333333303333333133333331333333303333333133333330333333303333333033333330333333313333333133333330333333313333333033333330333333303333333033333331333333313333333033333331333333303333333033333330333333303333333133333331333333303333333033333330333333313333333033333330333333313333333133333330333333313333333133333330333333303333333033333331333333313333333033333331333333313333333133333330333333303333333133333331333333303333333133333330333333303333333033333331333333313333333033333330333333313333333033333330333333303333333033333331333333313333333033333330333333313333333133333330333333313333333133333330333333303333333133333330333333303333333'
# entered_password = b'434a367a656c414441674d3d'
entered_password = entered_password[::-1] # 順番をひっくり返す
# print(entered_password)
entered_password = bytes.fromhex(entered_password.decode("l1")) # デコードしてから2進数に変換している
# entered_password = entered_password.decode("l1")
# print(entered_password)
entered_password = bytes.fromhex(entered_password.decode("l1")) # 同様の処理を2回繰り返す
# print(entered_password)
entered_password = bytes.fromhex(entered_password.decode("l1"))
print(entered_password) # ここで正解の文字列と変換された結果が同じになるようにする
#+end_src

